//
//  EmojiConverter.m
//  threadParser
//
//  Created by sonson on 09/01/11.
//  Copyright 2009 __MyCompanyName__. All rights reserved.
//

#import "EmojiConverter.h"

#ifdef _USE_EMOJI

int emoji_F3_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0xE119,		// 64	F340	au	枯れ葉
0xE11E,		// 65	F341	au	仕事かばん
0xE121,		// 66	F342	au	噴水
0xE122,		// 67	F343	au	キャンプ
0xE12D,		// 68	F344	au	麻雀
0xE12E,		// 69	F345	au	ＶＳ（バーサス）
0xE131,		// 70	F346	au	トロフィー
0,     		// 71
0xE511,		// 72	F348	au	スペイン国旗
0xE512,		// 73	F349	au	ロシア国旗
0xE137,		// 74	F34A	au	工事中
0xE13F,		// 75	F34B	au	風呂
0xE143,		// 76	F34C	au	祝日マーク
0xE44A,		// 77	F34D	au	夕方街並み
0xE523,		// 78	F34E	au	卵割り
0xE14A,		// 79	F34F	au	株価
0xE152,		// 80	F350	au	ポリス
0xE153,		// 81	F351	au	郵便局
0xE155,		// 82	F352	au	病院
0xE157,		// 83	F353	au	学校
0xE158,		// 84	F354	au	ホテル
0xE202,		// 85	F355	au	船
0xE207,		// 86	F356	au	18禁
0xE20B,		// 87	F357	au	圏内
0xE214,		// 88	F358	au	COOL!
0xE227,		// 89	F359	au	割マーク
0xE228,		// 90	F35A	au	ザ・マーク
0xE229,		// 91	F35B	au	ＩＤマーク
0xE22A,		// 92	F35C	au	満マーク
0xE22B,		// 93	F35D	au	空マーク
0xE22C,		// 94	F35E	au	指定マーク
0xE22D,		// 95	F35F	au	営業中マーク
0xE22E,		// 96	F360	au	上指差し
0xE22F,		// 97	F361	au	下指差し
0xE23E,		// 98	F362	au	占い
0xE250,		// 99	F363	au	マナーモード
0xE251,		// 100	F364	au	電源OFF
0xE301,		// 101	F365	au	メモする
0xE302,		// 102	F366	au	ネクタイ
0xE303,		// 103	F367	au	ハイビスカス
0xE306,		// 104	F368	au	花束
0xE308,		// 105	F369	au	サボテン
0xE30B,		// 106	F36A	au	お銚子＆杯
0xE30C,		// 107	F36B	au	乾杯
0xE30D,		// 108	F36C	au	祝マーク
0xE30F,		// 109	F36D	au	風邪薬
0xE310,		// 110	F36E	au	風船
0xE312,		// 111	F36F	au	クラッカー
0,     		// 112
0xE318,		// 113	F371	au	帽子
0xE31B,		// 114	F372	au	ロングブーツ
0xE31D,		// 115	F373	au	ネイル
0xE31F,		// 116	F374	au	美容院
0xE320,		// 117	F375	au	床屋
0xE321,		// 118	F376	au	着物
0xE322,		// 119	F377	au	ビキニ
0xE20C,		// 120	F378	au	ハート（トランプ）
0xE327,		// 121	F379	au	光るハート
0xE32A,		// 122	F37A	au	青ハート
0xE32B,		// 123	F37B	au	緑ハート
0xE32C,		// 124	F37C	au	黄ハート
0xE32D,		// 125	F37D	au	紫ハート
0xE32E,		// 126	F37E	au	きらきら
0,     		// 127
0xE013,		// 128	F380	au	スキー
0xE332,		// 129	F381	au	○
0xE338,		// 130	F382	au	日本茶
0xE339,		// 131	F383	au	食パン
0xE33A,		// 132	F384	au	ソフトクリーム
0xE33B,		// 133	F385	au	ポテト
0xE33C,		// 134	F386	au	だんご
0xE33D,		// 135	F387	au	おせんべい
0xE33E,		// 136	F388	au	ごはん
0xE33F,		// 137	F389	au	スパゲッティ
0xE341,		// 138	F38A	au	カレー
0xE343,		// 139	F38B	au	おでん
0xE344,		// 140	F38C	au	寿司
0xE345,		// 141	F38D	au	りんご
0xE346,		// 142	F38E	au	みかん
0xE349,		// 143	F38F	au	トマト
0xE34A,		// 144	F390	au	なす
0xE34C,		// 145	F391	au	弁当
0xE34D,		// 146	F392	au	鍋
0xE402,		// 147	F393	au	ふっ
0xE403,		// 148	F394	au	しょぼり
0xE404,		// 149	F395	au	勝ち誇り
0xE406,		// 150	F396	au	失敗
0xE407,		// 151	F397	au	わからん
0xE408,		// 152	F398	au	眠い
0xE40A,		// 153	F399	au	てれてれ
0xE40B,		// 154	F39A	au	青ざめ
0xE40C,		// 155	F39B	au	風邪ひき
0xE40D,		// 156	F39C	au	熱
0xE40E,		// 157	F39D	au	横目
0xE410,		// 158	F39E	au	びっくり
0xE40F,		// 159	F39F	au	あせり
0xE326,		// 160	F3A0	au	楽譜
0xE056,		// 161	F3A1	au	にこにこ
0xE417,		// 162	F3A2	au	チュー２
0xE418,		// 163	F3A3	au	チュッ
0xE41A,		// 164	F3A4	au	鼻
0xE41C,		// 165	F3A5	au	口
0xE41D,		// 166	F3A6	au	ゴメン／お願い
0xE41F,		// 167	F3A7	au	拍手
0xE420,		// 168	F3A8	au	ＯＫ！
0xE421,		// 169	F3A9	au	ブーイング
0xE41E,		// 170	F3AA	au	バイバイ
0xE423,		// 171	F3AB	au	ＮＧ
0xE424,		// 172	F3AC	au	ＯＫ！２
0xE426,		// 173	F3AD	au	平謝り
0xE425,		// 174	F3AE	au	カップル
0xE429,		// 175	F3AF	au	バニー
0xE042,		// 176	F3B0	au	トランペット
0xE42C,		// 177	F3B1	au	ビリヤード
0xE42D,		// 178	F3B2	au	水泳
0xE430,		// 179	F3B3	au	消防車
0xE431,		// 180	F3B4	au	救急車
0xE432,		// 181	F3B5	au	パトカー
0xE433,		// 182	F3B6	au	ジェットコースター
0xE436,		// 183	F3B7	au	門松
0xE438,		// 184	F3B8	au	雛祭り
0xE439,		// 185	F3B9	au	卒業式
0xE43A,		// 186	F3BA	au	入学式
0xE43B,		// 187	F3BB	au	こいのぼり
0xE43C,		// 188	F3BC	au	傘
0,     		// 189
0xE43F,		// 190	F3BE	au	かき氷
0xE440,		// 191	F3BF	au	線香花火
0xE441,		// 192	F3C0	au	巻き貝
0xE442,		// 193	F3C1	au	風鈴
0xE445,		// 194	F3C2	au	ハロウィン
0xE446,		// 195	F3C3	au	お月見
0xE448,		// 196	F3C4	au	サンタ
0xE44B,		// 197	F3C5	au	夜／流れ星
0xE44C,		// 198	F3C6	au	虹
0xE158,		// 199	F3C7	au	ホテル２
0xE449,		// 200	F3C8	au	日の出
0xE503,		// 201	F3C9	au	シルクハット
0xE504,		// 202	F3CA	au	デパート
0xE505,		// 203	F3CB	au	城（日本）
0xE506,		// 204	F3CC	au	城（ヨーロッパ）
0xE508,		// 205	F3CD	au	工場２
0xE50D,		// 206	F3CE	au	フランス国旗
0xE50E,		// 207	F3CF	au	ドイツ国旗
0xE50F,		// 208	F3D0	au	イタリア国旗
0xE510,		// 209	F3D1	au	イギリス国旗
0xE513,		// 210	F3D2	au	中国国旗
0xE514,		// 211	F3D3	au	韓国国旗
0xE515,		// 212	F3D4	au	白人
0xE516,		// 213	F3D5	au	中国人
0xE517,		// 214	F3D6	au	インド人
0xE518,		// 215	F3D7	au	おじいさん
0xE519,		// 216	F3D8	au	おばあさん
0xE51A,		// 217	F3D9	au	赤ちゃん
0xE51B,		// 218	F3DA	au	工事現場の人
0xE51C,		// 219	F3DB	au	お姫様
0xE520,		// 220	F3DC	au	イルカ
0xE51F,		// 221	F3DD	au	ダンス
0xE522,		// 222	F3DE	au	熱帯魚
0xE525,		// 223	F3DF	au	げじげじ
0xE526,		// 224	F3E0	au	象
0xE527,		// 225	F3E1	au	コアラ
0xE52B,		// 226	F3E2	au	ホルスタイン
0xE52D,		// 227	F3E3	au	ヘビ
0xE52E,		// 228	F3E4	au	鶏
0xE52F,		// 229	F3E5	au	うりぼう
0xE530,		// 230	F3E6	au	ふたこぶらくだ
0xE532,		// 231	F3E7	au	Ａ型
0xE533,		// 232	F3E8	au	Ｂ型
0xE535,		// 233	F3E9	au	Ｏ型
0xE534,		// 234	F3EA	au	ＡＢ型
0xE536,		// 235	F3EB	au	足跡
0xE007,		// 236	F3EC	au	スニーカー
0,     		// 237
0xE236,		// 238	F3EE	au	上向きカーブ矢印
0xE239,		// 239	F3EF	au	下向きカーブ矢印
0,     		// 240
0,     		// 241
0,     		// 242
0,     		// 243
0,     		// 244
0,     		// 245
0,     		// 246
0,     		// 247
0,     		// 248
0,     		// 249
0,     		// 250
0,     		// 251
0,     		// 252
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_F4_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0,     		// 64
0,     		// 65
0xE044,		// 66	F442	au	トロピカルドリンク
0,     		// 67
0,     		// 68
0xE017,		// 69	F445	au	サーフィン
0xE019,		// 70	F446	au	釣り
0,     		// 71
0,     		// 72
0,     		// 73
0,     		// 74
0xE409,		// 75	F44B	au	あかんべー
0xE10B,		// 76	F44C	au	ぶたの鼻
0xE305,		// 77	F44D	au	花
0,     		// 78
0,     		// 79
0,     		// 80
0,     		// 81
0,     		// 82
0,     		// 83
0,     		// 84
0,     		// 85
0,     		// 86
0,     		// 87
0xE022,		// 88	F458	au	リボンがけのハート
0,     		// 89
0,     		// 90
0,     		// 91
0,     		// 92
0,     		// 93
0xE345,		// 94	F45E	au	青りんご
0,     		// 95
0xE407,		// 96	F460	au	目がまわる時の記号
0xE416,		// 97	F461	au	ぷー（かわいく怒）
0xE416,		// 98	F462	au	ぶー（かわいく怒）（ネコ）
0xE44B,		// 99	F463	au	天の川
0xE418,		// 100	F464	au	チュー（ネコ）
0xE057,		// 101	F465	au	にこ（ネコ）
0xE103,		// 102	F466	au	メールする
0xE412,		// 103	F467	au	泣き笑い（ネコ）
0xE412,		// 104	F468	au	泣き笑い
0xE106,		// 105	F469	au	目がハート（ネコ）
0xE403,		// 106	F46A	au	ほえー（ネコ）
0xE403,		// 107	F46B	au	ほえー
0xE411,		// 108	F46C	au	涙ぽろり（ネコ）
0xE411,		// 109	F46D	au	涙ぽろり
0xE404,		// 110	F46E	au	きりり（ネコ）
0xE319,		// 111	F46F	au	ドレス
0,     		// 112
0xE039,		// 113	F471	au	駅
0,     		// 114
0,     		// 115
0,     		// 116
0xE103,		// 117	F475	au	ｅメールアイコン
0xE201,		// 118	F476	au	歩く人
0xE432,		// 119	F477	au	パトカーのランプ
0,     		// 120
0xE327,		// 121	F479	au	ドキドキしているハート
0xE523,		// 122	F47A	au	正面向きのひよこ
0,     		// 123
0xE103,		// 124	F47C	au	ハートつきメール
0,     		// 125
0,     		// 126
0,     		// 127
0,     		// 128
0xE43E,		// 129	F481	au	荒波
0xE110,		// 130	F482	au	双葉
0,     		// 131
0xE404,		// 132	F484	au	うっしっし（ネコ）
0xE405,		// 133	F485	au	うっしっし
0,     		// 134
0xE110,		// 135	F487	au	ハーブ
0xE010,		// 136	F488	au	グー
0xE210,		// 137	F489	au	＃
0xE012,		// 138	F48A	au	キャラクター（挙手）
0xE427,		// 139	F48B	au	キャラクター（万歳）
0xE403,		// 140	F48C	au	キャラクター（しょんぼり）
0xE416,		// 141	F48D	au	キャラクター（かわいく怒る）
0,     		// 142
0,     		// 143
0,     		// 144
0,     		// 145
0,     		// 146
0,     		// 147
0,     		// 148
0,     		// 149
0,     		// 150
0,     		// 151
0,     		// 152
0,     		// 153
0,     		// 154
0,     		// 155
0,     		// 156
0,     		// 157
0,     		// 158
0,     		// 159
0,     		// 160
0,     		// 161
0,     		// 162
0,     		// 163
0,     		// 164
0,     		// 165
0,     		// 166
0,     		// 167
0,     		// 168
0,     		// 169
0,     		// 170
0,     		// 171
0,     		// 172
0,     		// 173
0,     		// 174
0,     		// 175
0,     		// 176
0,     		// 177
0,     		// 178
0,     		// 179
0,     		// 180
0,     		// 181
0,     		// 182
0,     		// 183
0,     		// 184
0,     		// 185
0,     		// 186
0,     		// 187
0,     		// 188
0,     		// 189
0,     		// 190
0,     		// 191
0,     		// 192
0,     		// 193
0,     		// 194
0,     		// 195
0,     		// 196
0,     		// 197
0,     		// 198
0,     		// 199
0,     		// 200
0,     		// 201
0,     		// 202
0,     		// 203
0,     		// 204
0,     		// 205
0,     		// 206
0,     		// 207
0,     		// 208
0,     		// 209
0,     		// 210
0,     		// 211
0,     		// 212
0,     		// 213
0,     		// 214
0,     		// 215
0,     		// 216
0,     		// 217
0,     		// 218
0,     		// 219
0,     		// 220
0,     		// 221
0,     		// 222
0,     		// 223
0,     		// 224
0,     		// 225
0,     		// 226
0,     		// 227
0,     		// 228
0,     		// 229
0,     		// 230
0,     		// 231
0,     		// 232
0,     		// 233
0,     		// 234
0,     		// 235
0,     		// 236
0,     		// 237
0,     		// 238
0,     		// 239
0,     		// 240
0,     		// 241
0,     		// 242
0,     		// 243
0,     		// 244
0,     		// 245
0,     		// 246
0,     		// 247
0,     		// 248
0,     		// 249
0,     		// 250
0,     		// 251
0,     		// 252
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_F6_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0,     		// 64
0xE443,		// 65	F641	au	台風
0xE14E,		// 66	F642	au	信号
0xE115,		// 67	F643	au	マラソン
0xE32E,		// 68	F644	au	スパーク
0xE124,		// 69	F645	au	遊園地
0xE133,		// 70	F646	au	スロット（７７７）
0,     		// 71
0xE054,		// 72	F648	au	くじら
0xE057,		// 73	F649	au	顔１（うれしいカオ）
0xE059,		// 74	F64A	au	顔２（おこったカオ）
0xE411,		// 75	F64B	au	顔３（かなしいカオ）
0xE403,		// 76	F64C	au	顔４（つかれたカオ）
0xE13C,		// 77	F64D	au	眠い（ＺＺＺ…）
0xE10F,		// 78	F64E	au	電球
0xE023,		// 79	F64F	au	ハート２（われている）
0xE327,		// 80	F650	au	ハート３（大きい＆小さい）
0xE32E,		// 81	F651	au	スパーク２（キラリマーク）
0xE311,		// 82	F652	au	爆弾
0xE11D,		// 83	F653	au	炎
0,     		// 84
0xE30E,		// 85	F655	au	喫煙
0xE208,		// 86	F656	au	禁煙
0xE20A,		// 87	F657	au	車椅子
0xE209,		// 88	F658	au	若葉マーク
0xE252,		// 89	F659	au	！
0xE021,		// 90	F65A	au	！
0xE020,		// 91	F65B	au	？
0xE137,		// 92	F65C	au	立ち入り禁止
0xE048,		// 93	F65D	au	ゆきだるま
0xE04C,		// 94	F65E	au	月１
0xE13D,		// 95	F65F	au	いなずま
0xE04A,		// 96	F660	au	太陽
0xE04C,		// 97	F661	au	月２（顔つき）
0,     		// 98
0xE32F,		// 99	F663	au	星２
0xE04B,		// 100	F664	au	雨
0xE049,		// 101	F665	au	くもり
0xE04A,		// 102	F666	au	ときどき曇り
0xE23F,		// 103	F667	au	星座（おひつじ座）
0xE240,		// 104	F668	au	星座（おうし座）
0xE241,		// 105	F669	au	星座（双子座）
0xE242,		// 106	F66A	au	星座（かに座）
0xE243,		// 107	F66B	au	星座（しし座）
0xE244,		// 108	F66C	au	星座（おとめ座）
0xE245,		// 109	F66D	au	星座（天秤座）
0xE246,		// 110	F66E	au	星座（さそり座）
0xE247,		// 111	F66F	au	星座（いて座）
0xE248,		// 112	F670	au	星座（やぎ座）
0xE249,		// 113	F671	au	星座（水瓶座）
0xE24A,		// 114	F672	au	星座（うお座）
0xE24B,		// 115	F673	au	星座（へびつかい座）
0xE323,		// 116	F674	au	ブリーフケース(ハンドバック）
0xE148,		// 117	F675	au	ノート３
0xE125,		// 118	F676	au	チケット・キップ
0xE148,		// 119	F677	au	ノート２（開）
0,     		// 120
0xE301,		// 121	F679	au	エンピツ
0,     		// 122
0xE154,		// 123	F67B	au	ＡＴＭ
0xE156,		// 124	F67C	au	２４HOURS（コンビニ)
0xE151,		// 125	F67D	au	トイレ
0xE14F,		// 126	F67E	au	パーキング
0,     		// 127
0xE150,		// 128	F680	au	バス停
0xE14B,		// 129	F681	au	ｱﾝﾃﾅ（位置情報ﾏｰｸ）
0xE202,		// 130	F682	au	港（いかりマーク）
0xE14D,		// 131	F683	au	銀行
0xE036,		// 132	F684	au	家
0xE043,		// 133	F685	au	ゴハン１
0xE038,		// 134	F686	au	工場・建物
0xE136,		// 135	F687	au	自転車
0xE159,		// 136	F688	au	バス
0xE01F,		// 137	F689	au	新幹線
0xE01B,		// 138	F68A	au	車
0xE42F,		// 139	F68B	au	トラック
0xE01D,		// 140	F68C	au	飛行機
0xE01C,		// 141	F68D	au	ボート(船）
0xE01E,		// 142	F68E	au	電車
0xE018,		// 143	F68F	au	サッカー
0xE015,		// 144	F690	au	テニス
0,     		// 145
0xE132,		// 146	F692	au	チェッカーフラグ（モータースポーツ）
0xE016,		// 147	F693	au	野球ボール
0xE42B,		// 148	F694	au	フットボール
0xE123,		// 149	F695	au	温泉
0xE30B,		// 150	F696	au	居酒屋（赤ちょうちん）
0xE324,		// 151	F697	au	映画（かちんこ）
0xE44B,		// 152	F698	au	夜の橋
0xE509,		// 153	F699	au	東京タワー
0xE044,		// 154	F69A	au	ワイングラス
0xE044,		// 155	F69B	au	マティーニ（カクテルグラス）
0xE047,		// 156	F69C	au	マグカップ
0,     		// 157
0xE130,		// 158	F69E	au	当選弓矢
0,     		// 159
0xE12F,		// 160	F6A0	au	賞金
0,     		// 161
0xE033,		// 162	F6A2	au	クリスマスツリー
0xE030,		// 163	F6A3	au	花見(さくら）
0xE11B,		// 164	F6A4	au	お化け
0xE50B,		// 165	F6A5	au	旗（祝日・日の丸）
0xE348,		// 166	F6A6	au	スイカ
0xE118,		// 167	F6A7	au	はっぱ
0xE112,		// 168	F6A8	au	プレゼント
0xE046,		// 169	F6A9	au	ケーキ
0xE147,		// 170	F6AA	au	フライパン（目玉焼き）
0,     		// 171
0xE019,		// 172	F6AC	au	ふぐ
0xE347,		// 173	F6AD	au	イチゴ
0xE342,		// 174	F6AE	au	おにぎり
0xE120,		// 175	F6AF	au	ハンバーガー（ファーストフード）
0xE52C,		// 176	F6B0	au	うさぎ
0xE01A,		// 177	F6B1	au	うま
0xE109,		// 178	F6B2	au	さる
0xE531,		// 179	F6B3	au	かえる
0xE04F,		// 180	F6B4	au	猫
0xE055,		// 181	F6B5	au	ペンギン
0,     		// 182
0xE10B,		// 183	F6B7	au	ぶた
0xE052,		// 184	F6B8	au	犬（プードル）
0xE523,		// 185	F6B9	au	鳥
0xE052,		// 186	F6BA	au	猟犬
0xE307,		// 187	F6BB	au	やしのき
0xE305,		// 188	F6BC	au	ひまわり
0xE304,		// 189	F6BD	au	花
0xE334,		// 190	F6BE	au	怒り（ムカッ）
0xE331,		// 191	F6BF	au	雫（涙・汗）
0xE105,		// 192	F6C0	au	からかう（あっかんべえ）
0,     		// 193
0xE14C,		// 194	F6C2	au	力こぶ
0xE329,		// 195	F6C3	au	ハート５（矢がささっている）
0xE003,		// 196	F6C4	au	キスマーク
0xE10C,		// 197	F6C5	au	宇宙人
0,     		// 198
0xE536,		// 199	F6C7	au	足跡（犬）
0xE11A,		// 200	F6C8	au	悪魔
0,     		// 201
0xE315,		// 202	F6CA	au	丸秘
0,     		// 203
0xE00D,		// 204	F6CC	au	パンチ
0xE330,		// 205	F6CD	au	ダッシュ
0xE05A,		// 206	F6CE	au	ウンチマーク
0xE00F,		// 207	F6CF	au	人差し指サイン
0xE226,		// 208	F6D0	au	マル得
0xE11C,		// 209	F6D1	au	どくろ
0xE00E,		// 210	F6D2	au	おやゆびサイン
0xE002,		// 211	F6D3	au	小顔
0xE056,		// 212	F6D4	au	スマイルフェイス
0xE001,		// 213	F6D5	au	顔１
0,     		// 214
0,     		// 215
0xE230,		// 216	F6D8	au	指差し確認左
0xE231,		// 217	F6D9	au	指差し確認右
0,     		// 218
0xE12A,		// 219	F6DB	au	テレビ
0xE03C,		// 220	F6DC	au	マイク
0,     		// 221
0xE326,		// 222	F6DE	au	メロディ
0xE041,		// 223	F6DF	au	ギター（エレキ）
0,     		// 224
0xE30A,		// 225	F6E1	au	ヘッドフォン
0xE31C,		// 226	F6E2	au	口紅
0xE113,		// 227	F6E3	au	アクション（ピストル）
0xE31E,		// 228	F6E4	au	エステ
0xE126,		// 229	F6E5	au	CD/DVD
0xE006,		// 230	F6E6	au	婦人服
0xE10C,		// 231	F6E7	au	UFO
0xE213,		// 232	F6E8	au	更新（ＵＰ！）
0xE13B,		// 233	F6E9	au	注射器（血）
0xE141,		// 234	F6EA	au	スピーカ
0xE325,		// 235	F6EB	au	ベル
0xE110,		// 236	F6EC	au	四つ葉
0xE034,		// 237	F6ED	au	ジュエリー
0xE008,		// 238	F6EE	au	カメラ
0xE313,		// 239	F6EF	au	はさみ
0xE03D,		// 240	F6F0	au	ビデオカメラ
0xE114,		// 241	F6F1	au	むしめがね
0xE03F,		// 242	F6F2	au	鍵
0xE13E,		// 243	F6F3	au	くつ
0xE101,		// 244	F6F4	au	メールボックス
0xE144,		// 245	F6F5	au	錠前
0,     		// 246
0xE009,		// 247	F6F7	au	電話２
0xE112,		// 248	F6F8	au	パッケージ
0xE00B,		// 249	F6F9	au	ＦＡＸ
0xE103,		// 250	F6FA	au	封筒
0xE21C,		// 251	F6FB	au	四角数字１
0xE21D,		// 252	F6FC	au	四角数字2
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_F7_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0xE21E,		// 64	F740	au	四角数字3
0xE21F,		// 65	F741	au	四角数字4
0xE220,		// 66	F742	au	四角数字5
0xE221,		// 67	F743	au	四角数字6
0xE222,		// 68	F744	au	四角数字7
0xE223,		// 69	F745	au	四角数字8
0xE224,		// 70	F746	au	四角数字9
0,     		// 71
0,     		// 72
0xE23B,		// 73	F749	au	左向き三角１
0xE23A,		// 74	F74A	au	右向き三角１
0xE23D,		// 75	F74B	au	左向き三角２
0xE23C,		// 76	F74C	au	右向き三角２
0xE21B,		// 77	F74D	au	小四角１
0xE21A,		// 78	F74E	au	小四角２
0,     		// 79
0xE21B,		// 80	F750	au	中四角１
0xE21A,		// 81	F751	au	中四角２
0xE21B,		// 82	F752	au	小菱形１
0xE21B,		// 83	F753	au	小菱形２
0xE21B,		// 84	F754	au	大四角１
0xE21A,		// 85	F755	au	大四角１
0xE219,		// 86	F756	au	小丸１
0xE219,		// 87	F757	au	小丸2
0,     		// 88
0,     		// 89
0,     		// 90
0xE232,		// 91	F75B	au	上矢印１
0xE233,		// 92	F75C	au	下矢印１
0,     		// 93
0,     		// 94
0,     		// 95
0,     		// 96
0,     		// 97
0xE21B,		// 98	F762	au	大菱形１
0xE21B,		// 99	F763	au	大菱形２
0xE21B,		// 100	F764	au	特大四角１
0xE21A,		// 101	F765	au	特大四角２
0xE219,		// 102	F766	au	大丸１
0xE219,		// 103	F767	au	大丸２
0xE237,		// 104	F768	au	上矢印２
0xE238,		// 105	F769	au	下矢印２
0xE537,		// 106	F76A	au	トレードマーク（TM）
0xE333,		// 107	F76B	au	かける
0xE333,		// 108	F76C	au	バツ１
0xE333,		// 109	F76D	au	バツ２
0xE234,		// 110	F76E	au	右矢印１
0xE235,		// 111	F76F	au	左矢印１
0,     		// 112
0xE236,		// 113	F771	au	右矢印２
0xE239,		// 114	F772	au	左矢印２
0,     		// 115
0xE24E,		// 116	F774	au	コピーライトマーク
0xE24F,		// 117	F775	au	レジスタードマーク
0,     		// 118
0,     		// 119
0,     		// 120
0,     		// 121
0,     		// 122
0,     		// 123
0,     		// 124
0xE301,		// 125	F77D	au	文書１
0xE316,		// 126	F77E	au	フロッピーディスク１
0,     		// 127
0,     		// 128
0xE301,		// 129	F781	au	クリップボード
0xE148,		// 130	F782	au	本１
0xE148,		// 131	F783	au	本２
0xE148,		// 132	F784	au	本３
0xE148,		// 133	F785	au	本４
0xE301,		// 134	F786	au	文書２
0,     		// 135
0xE148,		// 136	F788	au	ノート１
0xE148,		// 137	F789	au	Roldex
0,     		// 138
0xE148,		// 139	F78B	au	台帳
0xE148,		// 140	F78C	au	複数本
0,     		// 141
0xE03A,		// 142	F78E	au	ガススタンド
0,     		// 143
0xE50C,		// 144	F790	au	ＵＳＡ
0xE14A,		// 145	F791	au	チャート（棒グラフ）
0xE14A,		// 146	F792	au	グラフ１（折れ線グラフ）
0,     		// 147
0,     		// 148
0,     		// 149
0xE12F,		// 150	F796	au	ドル
0,     		// 151
0,     		// 152
0,     		// 153
0,     		// 154
0xE03D,		// 155	F79B	au	ハンディカム
0,     		// 156
0xE129,		// 157	F79D	au	ビデオテープ
0,     		// 158
0xE316,		// 159	F79F	au	フロッピー２
0,     		// 160
0,     		// 161
0xE12F,		// 162	F7A2	au	ドル札
0,     		// 163
0,     		// 164
0xE00A,		// 165	F7A5	au	電話３
0,     		// 166
0,     		// 167
0,     		// 168
0,     		// 169
0,     		// 170
0,     		// 171
0,     		// 172
0,     		// 173
0xE103,		// 174	F7AE	au	封筒２
0,     		// 175
0,     		// 176
0xE02E,		// 177	F7B1	au	時計
0xE022,		// 178	F7B2	au	ハート
0xE009,		// 179	F7B3	au	電話１（プッシュホン）
0xE045,		// 180	F7B4	au	カップ
0,     		// 181
0xE014,		// 182	F7B6	au	ゴルフ
0xE42A,		// 183	F7B7	au	バスケットボール
0,     		// 184
0xE502,		// 185	F7B9	au	アート
0xE503,		// 186	F7BA	au	演劇
0,     		// 187
0xE314,		// 188	F7BC	au	リボン
0xE34B,		// 189	F7BD	au	バースデー
0xE20E,		// 190	F7BE	au	スペード
0xE20D,		// 191	F7BF	au	ダイヤ
0xE20F,		// 192	F7C0	au	クラブ
0xE419,		// 193	F7C1	au	目
0xE41B,		// 194	F7C2	au	耳
0xE011,		// 195	F7C3	au	手（チョキ）
0xE012,		// 196	F7C4	au	手（パー）
0,     		// 197
0xE04C,		// 198	F7C6	au	やや欠け月
0xE04C,		// 199	F7C7	au	半月
0,     		// 200
0xE225,		// 201	F7C9	au	四角数字0
0xE24D,		// 202	F7CA	au	決定
0xE407,		// 203	F7CB	au	ふらふら
0xE327,		// 204	F7CC	au	かわいい
0,     		// 205
0xE331,		// 206	F7CE	au	あせあせ（飛び散る汗）
0,     		// 207
0,     		// 208
0xE340,		// 209	F7D1	au	ラーメン
0,     		// 210
0xE144,		// 211	F7D3	au	ロック確認
0,     		// 212
0,     		// 213
0,     		// 214
0,     		// 215
0,     		// 216
0,     		// 217
0,     		// 218
0,     		// 219
0xE114,		// 220	F7DC	au	見る
0xE235,		// 221	F7DD	au	戻る
0,     		// 222
0xE104,		// 223	F7DF	au	終了
0xE036,		// 224	F7E0	au	ホーム
0xE101,		// 225	F7E1	au	受信箱１
0xE301,		// 226	F7E2	au	マーク
0xE144,		// 227	F7E3	au	個人
0,     		// 228
0xE212,		// 229	F7E5	au	NEW
0xE006,		// 230	F7E6	au	紳士服
0xE007,		// 231	F7E7	au	紳士靴
0xE00C,		// 232	F7E8	au	パソコン
0xE128,		// 233	F7E9	au	ラジオ
0xE032,		// 234	F7EA	au	バラ
0xE037,		// 235	F7EB	au	チャペル
0xE434,		// 236	F7EC	au	地下鉄
0xE03B,		// 237	F7ED	au	富士山
0xE03E,		// 238	F7EE	au	八分音符
0xE04E,		// 239	F7EF	au	天使
0xE050,		// 240	F7F0	au	トラ
0xE051,		// 241	F7F1	au	くま
0xE053,		// 242	F7F2	au	ねずみ
0xE405,		// 243	F7F3	au	ウインク
0xE106,		// 244	F7F4	au	目がハート
0xE410,		// 245	F7F5	au	ショッキング
0xE108,		// 246	F7F6	au	困り
0xE10A,		// 247	F7F7	au	たこ
0xE10D,		// 248	F7F8	au	ロケット
0xE10E,		// 249	F7F9	au	王冠
0xE111,		// 250	F7FA	au	チュー
0xE116,		// 251	F7FB	au	ハンマー
0xE117,		// 252	F7FC	au	打ち上げ花火
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_F8_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0,     		// 64
0,     		// 65
0,     		// 66
0,     		// 67
0,     		// 68
0,     		// 69
0,     		// 70
0,     		// 71
0,     		// 72
0,     		// 73
0,     		// 74
0,     		// 75
0,     		// 76
0,     		// 77
0,     		// 78
0,     		// 79
0,     		// 80
0,     		// 81
0,     		// 82
0,     		// 83
0,     		// 84
0,     		// 85
0,     		// 86
0,     		// 87
0,     		// 88
0,     		// 89
0,     		// 90
0,     		// 91
0,     		// 92
0,     		// 93
0,     		// 94
0,     		// 95
0,     		// 96
0,     		// 97
0,     		// 98
0,     		// 99
0,     		// 100
0,     		// 101
0,     		// 102
0,     		// 103
0,     		// 104
0,     		// 105
0,     		// 106
0,     		// 107
0,     		// 108
0,     		// 109
0,     		// 110
0,     		// 111
0,     		// 112
0,     		// 113
0,     		// 114
0,     		// 115
0,     		// 116
0,     		// 117
0,     		// 118
0,     		// 119
0,     		// 120
0,     		// 121
0,     		// 122
0,     		// 123
0,     		// 124
0,     		// 125
0,     		// 126
0,     		// 127
0,     		// 128
0,     		// 129
0,     		// 130
0,     		// 131
0,     		// 132
0,     		// 133
0,     		// 134
0,     		// 135
0,     		// 136
0,     		// 137
0,     		// 138
0,     		// 139
0,     		// 140
0,     		// 141
0,     		// 142
0,     		// 143
0,     		// 144
0,     		// 145
0,     		// 146
0,     		// 147
0,     		// 148
0,     		// 149
0,     		// 150
0,     		// 151
0,     		// 152
0,     		// 153
0,     		// 154
0,     		// 155
0,     		// 156
0,     		// 157
0,     		// 158
0xE04A,		// 159	F89F	docomo	晴れ
0xE049,		// 160	F8A0	docomo	曇り
0xE04B,		// 161	F8A1	docomo	雨
0xE048,		// 162	F8A2	docomo	雪
0xE13D,		// 163	F8A3	docomo	雷
0xE443,		// 164	F8A4	docomo	台風
0,     		// 165
0xE43C,		// 166	F8A6	docomo	小雨
0xE23F,		// 167	F8A7	docomo	牡羊座
0xE240,		// 168	F8A8	docomo	牡牛座
0xE241,		// 169	F8A9	docomo	双子座
0xE242,		// 170	F8AA	docomo	蟹座
0xE243,		// 171	F8AB	docomo	獅子座
0xE244,		// 172	F8AC	docomo	乙女座
0xE245,		// 173	F8AD	docomo	天秤座
0xE246,		// 174	F8AE	docomo	蠍座
0xE247,		// 175	F8AF	docomo	射手座
0xE248,		// 176	F8B0	docomo	山羊座
0xE249,		// 177	F8B1	docomo	水瓶座
0xE24A,		// 178	F8B2	docomo	魚座
0,     		// 179
0xE016,		// 180	F8B4	docomo	野球
0xE014,		// 181	F8B5	docomo	ゴルフ
0xE015,		// 182	F8B6	docomo	テニス
0xE018,		// 183	F8B7	docomo	サッカー
0xE013,		// 184	F8B8	docomo	スキー
0xE42A,		// 185	F8B9	docomo	バスケットボール
0xE132,		// 186	F8BA	docomo	モータースポーツ
0,     		// 187
0xE01E,		// 188	F8BC	docomo	電車
0xE434,		// 189	F8BD	docomo	地下鉄
0xE435,		// 190	F8BE	docomo	新幹線
0xE01B,		// 191	F8BF	docomo	車（セダン）
0xE42E,		// 192	F8C0	docomo	車（ＲＶ）
0xE159,		// 193	F8C1	docomo	バス
0xE202,		// 194	F8C2	docomo	船
0xE01D,		// 195	F8C3	docomo	飛行機
0xE036,		// 196	F8C4	docomo	家
0xE038,		// 197	F8C5	docomo	ビル
0xE153,		// 198	F8C6	docomo	郵便局
0xE155,		// 199	F8C7	docomo	病院
0xE14D,		// 200	F8C8	docomo	銀行
0xE154,		// 201	F8C9	docomo	ＡＴＭ
0xE158,		// 202	F8CA	docomo	ホテル
0xE156,		// 203	F8CB	docomo	コンビニ
0xE03A,		// 204	F8CC	docomo	ガソリンスタンド
0xE14F,		// 205	F8CD	docomo	駐車場
0xE14E,		// 206	F8CE	docomo	信号
0xE151,		// 207	F8CF	docomo	トイレ
0xE043,		// 208	F8D0	docomo	レストラン
0xE045,		// 209	F8D1	docomo	喫茶店
0xE044,		// 210	F8D2	docomo	バー
0xE047,		// 211	F8D3	docomo	ビール
0xE120,		// 212	F8D4	docomo	ファーストフード
0xE13E,		// 213	F8D5	docomo	ブティック
0xE313,		// 214	F8D6	docomo	美容院
0xE03C,		// 215	F8D7	docomo	カラオケ
0xE03D,		// 216	F8D8	docomo	映画
0xE236,		// 217	F8D9	docomo	右斜め上
0,     		// 218
0xE30A,		// 219	F8DB	docomo	音楽
0xE502,		// 220	F8DC	docomo	アート
0xE503,		// 221	F8DD	docomo	演劇
0,     		// 222
0xE125,		// 223	F8DF	docomo	チケット
0xE30E,		// 224	F8E0	docomo	喫煙
0xE208,		// 225	F8E1	docomo	禁煙
0xE008,		// 226	F8E2	docomo	カメラ
0xE323,		// 227	F8E3	docomo	カバン
0xE148,		// 228	F8E4	docomo	本
0xE314,		// 229	F8E5	docomo	リボン
0xE112,		// 230	F8E6	docomo	プレゼント
0xE34B,		// 231	F8E7	docomo	バースデー
0xE009,		// 232	F8E8	docomo	電話
0xE00A,		// 233	F8E9	docomo	携帯電話
0xE301,		// 234	F8EA	docomo	メモ
0xE12A,		// 235	F8EB	docomo	ＴＶ
0,     		// 236
0xE126,		// 237	F8ED	docomo	ＣＤ
0xE20C,		// 238	F8EE	docomo	ハート
0xE20E,		// 239	F8EF	docomo	スペード
0xE20D,		// 240	F8F0	docomo	ダイヤ
0xE20F,		// 241	F8F1	docomo	クラブ
0xE419,		// 242	F8F2	docomo	目
0xE41B,		// 243	F8F3	docomo	耳
0xE010,		// 244	F8F4	docomo	手（グー）
0xE011,		// 245	F8F5	docomo	手（チョキ）
0xE012,		// 246	F8F6	docomo	手（パー）
0xE238,		// 247	F8F7	docomo	右斜め下
0xE237,		// 248	F8F8	docomo	左斜め上
0xE536,		// 249	F8F9	docomo	足
0xE007,		// 250	F8FA	docomo	くつ
0,     		// 251
0xE20A,		// 252	F8FC	docomo	車椅子
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_F9_codeTable[] = {
0,     		// 0
0,     		// 1
0,     		// 2
0,     		// 3
0,     		// 4
0,     		// 5
0,     		// 6
0,     		// 7
0,     		// 8
0,     		// 9
0,     		// 10
0,     		// 11
0,     		// 12
0,     		// 13
0,     		// 14
0,     		// 15
0,     		// 16
0,     		// 17
0,     		// 18
0,     		// 19
0,     		// 20
0,     		// 21
0,     		// 22
0,     		// 23
0,     		// 24
0,     		// 25
0,     		// 26
0,     		// 27
0,     		// 28
0,     		// 29
0,     		// 30
0,     		// 31
0,     		// 32
0,     		// 33
0,     		// 34
0,     		// 35
0,     		// 36
0,     		// 37
0,     		// 38
0,     		// 39
0,     		// 40
0,     		// 41
0,     		// 42
0,     		// 43
0,     		// 44
0,     		// 45
0,     		// 46
0,     		// 47
0,     		// 48
0,     		// 49
0,     		// 50
0,     		// 51
0,     		// 52
0,     		// 53
0,     		// 54
0,     		// 55
0,     		// 56
0,     		// 57
0,     		// 58
0,     		// 59
0,     		// 60
0,     		// 61
0,     		// 62
0,     		// 63
0,     		// 64
0xE04C,		// 65	F941	docomo	やや欠け月
0xE04C,		// 66	F942	docomo	半月
0xE04C,		// 67	F943	docomo	三日月
0,     		// 68
0xE052,		// 69	F945	docomo	犬
0xE04F,		// 70	F946	docomo	猫
0xE01C,		// 71	F947	docomo	リゾート
0xE033,		// 72	F948	docomo	クリスマス
0xE239,		// 73	F949	docomo	左斜め下
0,     		// 74
0,     		// 75
0,     		// 76
0,     		// 77
0,     		// 78
0,     		// 79
0xE324,		// 80	F950	docomo	カチンコ
0,     		// 81
0,     		// 82
0,     		// 83
0,     		// 84
0,     		// 85
0xE11F,		// 86	F956	docomo	いす
0xE44B,		// 87	F957	docomo	夜
0,     		// 88
0,     		// 89
0,     		// 90
0,     		// 91
0,     		// 92
0,     		// 93
0xE02D,		// 94	F95E	docomo	時計
0,     		// 95
0,     		// 96
0,     		// 97
0,     		// 98
0,     		// 99
0,     		// 100
0,     		// 101
0,     		// 102
0,     		// 103
0,     		// 104
0,     		// 105
0,     		// 106
0,     		// 107
0,     		// 108
0,     		// 109
0,     		// 110
0,     		// 111
0,     		// 112
0,     		// 113
0xE104,		// 114	F972	docomo	phoneto
0xE103,		// 115	F973	docomo	mailto
0xE00B,		// 116	F974	docomo	faxto
0,     		// 117
0,     		// 118
0xE103,		// 119	F977	docomo	メール
0,     		// 120
0,     		// 121
0,     		// 122
0,     		// 123
0xE229,		// 124	F97C	docomo	ID
0xE03F,		// 125	F97D	docomo	パスワード
0,     		// 126
0,     		// 127
0,     		// 128
0xE114,		// 129	F981	docomo	サーチ（調べる）
0xE212,		// 130	F982	docomo	ＮＥＷ
0,     		// 131
0xE211,		// 132	F984	docomo	フリーダイヤル
0xE210,		// 133	F985	docomo	シャープダイヤル
0,     		// 134
0xE21C,		// 135	F987	docomo	1
0xE21D,		// 136	F988	docomo	2
0xE21E,		// 137	F989	docomo	3
0xE21F,		// 138	F98A	docomo	4
0xE220,		// 139	F98B	docomo	5
0xE221,		// 140	F98C	docomo	6
0xE222,		// 141	F98D	docomo	7
0xE223,		// 142	F98E	docomo	8
0xE224,		// 143	F98F	docomo	9
0xE225,		// 144	F990	docomo	0
0xE022,		// 145	F991	docomo	黒ハート
0xE327,		// 146	F992	docomo	揺れるハート
0xE023,		// 147	F993	docomo	失恋
0xE327,		// 148	F994	docomo	ハートたち（複数ハート）
0xE057,		// 149	F995	docomo	わーい（嬉しい顔）
0xE059,		// 150	F996	docomo	ちっ（怒った顔）
0xE058,		// 151	F997	docomo	がく〜（落胆した顔）
0xE407,		// 152	F998	docomo	もうやだ〜（悲しい顔）
0xE406,		// 153	F999	docomo	ふらふら
0xE236,		// 154	F99A	docomo	グッド（上向き矢印）
0xE03E,		// 155	F99B	docomo	るんるん
0xE123,		// 156	F99C	docomo	いい気分（温泉）
0,     		// 157
0xE003,		// 158	F99E	docomo	キスマーク
0xE32E,		// 159	F99F	docomo	ぴかぴか（新しい）
0xE10F,		// 160	F9A0	docomo	ひらめき
0xE334,		// 161	F9A1	docomo	むかっ（怒り）
0xE00D,		// 162	F9A2	docomo	パンチ
0xE311,		// 163	F9A3	docomo	爆弾
0xE326,		// 164	F9A4	docomo	ムード
0xE238,		// 165	F9A5	docomo	バッド（下向き矢印）
0xE13C,		// 166	F9A6	docomo	眠い(睡眠)
0xE021,		// 167	F9A7	docomo	exclamation
0,     		// 168
0,     		// 169
0,     		// 170
0xE331,		// 171	F9AB	docomo	あせあせ（飛び散る汗）
0xE331,		// 172	F9AC	docomo	たらーっ（汗）
0xE330,		// 173	F9AD	docomo	ダッシュ（走り出すさま）
0,     		// 174
0,     		// 175
0xE24D,		// 176	F9B0	docomo	決定
0,     		// 177
0,     		// 178
0xE006,		// 179	F9B3	docomo	Tシャツ（ボーダー）
0,     		// 180
0xE31C,		// 181	F9B5	docomo	化粧
0,     		// 182
0,     		// 183
0xE325,		// 184	F9B8	docomo	チャペル
0,     		// 185
0xE12F,		// 186	F9BA	docomo	ドル袋
0xE00C,		// 187	F9BB	docomo	パソコン
0xE103,		// 188	F9BC	docomo	ラブレター
0,     		// 189
0xE301,		// 190	F9BE	docomo	鉛筆
0xE10E,		// 191	F9BF	docomo	王冠
0xE034,		// 192	F9C0	docomo	指輪
0,     		// 193
0xE136,		// 194	F9C2	docomo	自転車
0xE338,		// 195	F9C3	docomo	湯のみ
0,     		// 196
0xE403,		// 197	F9C5	docomo	考えてる顔
0xE40A,		// 198	F9C6	docomo	ほっとした顔
0xE415,		// 199	F9C7	docomo	冷や汗
0xE108,		// 200	F9C8	docomo	冷や汗2
0xE416,		// 201	F9C9	docomo	ぷっくっくな顔
0xE40E,		// 202	F9CA	docomo	ボケーっとした顔
0xE106,		// 203	F9CB	docomo	目がハート
0xE00E,		// 204	F9CC	docomo	指でOK
0xE105,		// 205	F9CD	docomo	あっかんべー
0xE405,		// 206	F9CE	docomo	ウィンク
0xE40A,		// 207	F9CF	docomo	うれしい顔
0xE406,		// 208	F9D0	docomo	がまん顔
0xE402,		// 209	F9D1	docomo	猫2
0xE411,		// 210	F9D2	docomo	泣き顔
0xE413,		// 211	F9D3	docomo	涙
0,     		// 212
0,     		// 213
0xE24E,		// 214	F9D6	docomo	コピーライト
0xE537,		// 215	F9D7	docomo	トレードマーク
0xE115,		// 216	F9D8	docomo	走る人
0xE315,		// 217	F9D9	docomo	マル秘
0,     		// 218
0xE24F,		// 219	F9DB	docomo	レジスタードトレードマーク
0xE252,		// 220	F9DC	docomo	危険・警告
0,     		// 221
0xE22B,		// 222	F9DE	docomo	空室・空席・空車
0,     		// 223
0xE22A,		// 224	F9E0	docomo	満室・満席・満車
0,     		// 225
0,     		// 226
0xE157,		// 227	F9E3	docomo	学校
0xE43E,		// 228	F9E4	docomo	波
0xE03B,		// 229	F9E5	docomo	富士山
0xE110,		// 230	F9E6	docomo	クローバー
0,     		// 231
0xE304,		// 232	F9E8	docomo	チューリップ
0,     		// 233
0xE345,		// 234	F9EA	docomo	りんご
0xE110,		// 235	F9EB	docomo	芽
0xE118,		// 236	F9EC	docomo	もみじ
0xE030,		// 237	F9ED	docomo	桜
0xE342,		// 238	F9EE	docomo	おにぎり
0xE046,		// 239	F9EF	docomo	ショートケーキ
0xE30B,		// 240	F9F0	docomo	とっくり（おちょこ付き）
0xE340,		// 241	F9F1	docomo	どんぶり
0xE339,		// 242	F9F2	docomo	パン
0,     		// 243
0xE523,		// 244	F9F4	docomo	ひよこ
0xE055,		// 245	F9F5	docomo	ペンギン
0xE019,		// 246	F9F6	docomo	魚
0xE056,		// 247	F9F7	docomo	うまい！
0xE404,		// 248	F9F8	docomo	ウッシッシ
0xE01A,		// 249	F9F9	docomo	ウマ
0xE10B,		// 250	F9FA	docomo	ブタ
0xE044,		// 251	F9FB	docomo	ワイングラス
0xE107,		// 252	F9FC	docomo	げっそり
0,     		// 253
0,     		// 254
0,     		// 255
};
int emoji_firstByte_Table[] = {
0,		// 0
0,		// 1
0,		// 2
0,		// 3
0,		// 4
0,		// 5
0,		// 6
0,		// 7
0,		// 8
0,		// 9
0,		// 10
0,		// 11
0,		// 12
0,		// 13
0,		// 14
0,		// 15
0,		// 16
0,		// 17
0,		// 18
0,		// 19
0,		// 20
0,		// 21
0,		// 22
0,		// 23
0,		// 24
0,		// 25
0,		// 26
0,		// 27
0,		// 28
0,		// 29
0,		// 30
0,		// 31
0,		// 32
0,		// 33
0,		// 34
0,		// 35
0,		// 36
0,		// 37
0,		// 38
0,		// 39
0,		// 40
0,		// 41
0,		// 42
0,		// 43
0,		// 44
0,		// 45
0,		// 46
0,		// 47
0,		// 48
0,		// 49
0,		// 50
0,		// 51
0,		// 52
0,		// 53
0,		// 54
0,		// 55
0,		// 56
0,		// 57
0,		// 58
0,		// 59
0,		// 60
0,		// 61
0,		// 62
0,		// 63
0,		// 64
0,		// 65
0,		// 66
0,		// 67
0,		// 68
0,		// 69
0,		// 70
0,		// 71
0,		// 72
0,		// 73
0,		// 74
0,		// 75
0,		// 76
0,		// 77
0,		// 78
0,		// 79
0,		// 80
0,		// 81
0,		// 82
0,		// 83
0,		// 84
0,		// 85
0,		// 86
0,		// 87
0,		// 88
0,		// 89
0,		// 90
0,		// 91
0,		// 92
0,		// 93
0,		// 94
0,		// 95
0,		// 96
0,		// 97
0,		// 98
0,		// 99
0,		// 100
0,		// 101
0,		// 102
0,		// 103
0,		// 104
0,		// 105
0,		// 106
0,		// 107
0,		// 108
0,		// 109
0,		// 110
0,		// 111
0,		// 112
0,		// 113
0,		// 114
0,		// 115
0,		// 116
0,		// 117
0,		// 118
0,		// 119
0,		// 120
0,		// 121
0,		// 122
0,		// 123
0,		// 124
0,		// 125
0,		// 126
0,		// 127
0,		// 128
0,		// 129
0,		// 130
0,		// 131
0,		// 132
0,		// 133
0,		// 134
0,		// 135
0,		// 136
0,		// 137
0,		// 138
0,		// 139
0,		// 140
0,		// 141
0,		// 142
0,		// 143
0,		// 144
0,		// 145
0,		// 146
0,		// 147
0,		// 148
0,		// 149
0,		// 150
0,		// 151
0,		// 152
0,		// 153
0,		// 154
0,		// 155
0,		// 156
0,		// 157
0,		// 158
0,		// 159
0,		// 160
0,		// 161
0,		// 162
0,		// 163
0,		// 164
0,		// 165
0,		// 166
0,		// 167
0,		// 168
0,		// 169
0,		// 170
0,		// 171
0,		// 172
0,		// 173
0,		// 174
0,		// 175
0,		// 176
0,		// 177
0,		// 178
0,		// 179
0,		// 180
0,		// 181
0,		// 182
0,		// 183
0,		// 184
0,		// 185
0,		// 186
0,		// 187
0,		// 188
0,		// 189
0,		// 190
0,		// 191
0,		// 192
0,		// 193
0,		// 194
0,		// 195
0,		// 196
0,		// 197
0,		// 198
0,		// 199
0,		// 200
0,		// 201
0,		// 202
0,		// 203
0,		// 204
0,		// 205
0,		// 206
0,		// 207
0,		// 208
0,		// 209
0,		// 210
0,		// 211
0,		// 212
0,		// 213
0,		// 214
0,		// 215
0,		// 216
0,		// 217
0,		// 218
0,		// 219
0,		// 220
0,		// 221
0,		// 222
0,		// 223
0,		// 224
0,		// 225
0,		// 226
0,		// 227
0,		// 228
0,		// 229
0,		// 230
0,		// 231
0,		// 232
0,		// 233
0,		// 234
0,		// 235
0,		// 236
0,		// 237
0,		// 238
0,		// 239
0,		// 240
0,		// 241
0,		// 242
1,		// 243
2,		// 244
0,		// 245
3,		// 246
4,		// 247
5,		// 248
6,		// 249
0,		// 250
0,		// 251
0,		// 252
0,		// 253
0,		// 254
0,		// 255
};

/*
emoji_F3_codeTable
emoji_F4_codeTable
emoji_F6_codeTable
emoji_F7_codeTable
emoji_F8_codeTable
emoji_F9_codeTable
emoji_firstByte_Table
*/

int *tables[6];

void setup_emoji_table() {
	tables[0] = emoji_F3_codeTable;
	tables[1] = emoji_F4_codeTable;
	tables[2] = emoji_F6_codeTable;
	tables[3] = emoji_F7_codeTable;
	tables[4] = emoji_F8_codeTable;
	tables[5] = emoji_F9_codeTable;
}

int codeOfEmoji( char*p ) {
	unsigned char firstByte = (unsigned char)*p;
	unsigned char secondByte = (unsigned char)*(p+1);
	
	int offset = emoji_firstByte_Table[firstByte] - 1;
	
	if( offset < 0 )
		return 0;
	
	int *target_table = tables[offset];
	return target_table[secondByte];
}

#endif